{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspaceName": {
            "defaultValue": "<Enter Log Analytics Workspace name>",
            "type": "string",
            "metadata": {
                "description": "Workspace name for Log Analytics where Sentinel is setup"
            }
        },
        "ruleId": {
        	"type": "string",
        	"defaultValue": "16938ef8-4aed-4716-980a-6d34e98f4765"
        }
    },
    "functions": [],
    "variables": {},
    "resources": [
        {
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "name": "[concat(parameters('workspaceName'),'/Microsoft.SecurityInsights/',parameters('ruleId'))]",
            "apiVersion": "2021-03-01-preview",
            "kind": "Scheduled",
            "location": "[resourceGroup().location]",
            "dependsOn": [],
            "properties": {
                "description": "This first rule was created for the MS LAB demo.",
                "displayName": "[MS LAB] This is my rule number #01",
                "enabled": true,
                "query": "SecurityEvent | where EventID == 4625 | summarize count() by Computer, IpAddress, _ResourceId | where count_ > 3",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT20M",
                "severity": "High",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "tactics": ["InitialAccess"],
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "entityMappings":[
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "columnName": "Computer",
                                "identifier": "HostName"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "columnName": "IpAddress",
                                "identifier": "Address"
                            }
                        ]
                    },
                    {
                        "entityType": "AzureResource",
                        "fieldMappings": [
                            {
                                "columnName": "_ResourceId",
                                "identifier": "ResourceId"
                            }
                        ]
                    }
                ]
            }
        }
    ],
    "outputs": {
        "ruleId":
        {
            "type": "string",
            "value": "[parameters('ruleId')]"
        }
    }
}
